In [0]:
# Importando o pandas e o leitor de url
import pandas as pd
import io
import requests

In [0]:
# Lendo a url do arquivo csv
url = "https://raw.githubusercontent.com/dressalsl/tutorialPandas/master/usandoSelecionadores/bank.csv"
df = pd.read_csv(url, sep=';')

In [0]:
df.head()

   age          job  marital  education  ... pdays  previous poutcome   y
0   30   unemployed  married    primary  ...    -1         0  unknown  no
1   33     services  married  secondary  ...   339         4  failure  no
2   35   management   single   tertiary  ...   330         1  failure  no
3   30   management  married   tertiary  ...    -1         0  unknown  no
4   59  blue-collar  married  secondary  ...    -1         0  unknown  no

[5 rows x 17 columns]

In [0]:
# Filter serve para criar subdataframe com as colunas desejadas

In [0]:
# o regex filtra por uma expressão regular, nesse caso ele filtrou colunas que ṕossuem a letra "j" ou "b"
df.filter(regex='[jb]').head()

           job  balance
0   unemployed     1787
1     services     4789
2   management     1350
3   management     1476
4  blue-collar        0

In [0]:
# Pode usar a expressão regular como o nome da coluna
df.filter(regex='(job|contact|month)').head()

           job   contact month
0   unemployed  cellular   oct
1     services  cellular   may
2   management  cellular   apr
3   management   unknown   jun
4  blue-collar   unknown   may

In [0]:
# Com o argumento like são selecionadas apenas as colunas que o texto foi passado
df.filter(like='balance').head()

   balance
0     1787
1     4789
2     1350
3     1476
4        0

In [0]:
# Seleciona pelo nome das colunas
df.filter(items=['age', 'education']).head()

   age  education
0   30    primary
1   33  secondary
2   35   tertiary
3   30   tertiary
4   59  secondary